app/controllers/commits_controller.rb

SELECT "commits".* FROM "commits"
---
  def index
    @commits = Commit.all

SELECT  "commits".* FROM "commits" WHERE "commits"."sha" = ? LIMIT ?  [["sha", "59cf1e5cf3a6ac9b7000fe098516e3a0ca06e0f2"], ["LIMIT", 1]]
---
    def set_commit
      @commit = Commit.find_by_sha(params[:sha])